Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
 }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/b740d1033c5157e1fc4335407fdc9cf6e919fc6834ed7a9ce7d453ed2f503233.zip" -> "builds/d476bacece0bb69e956795a986f25ad16f982331047d901fd836b8f6aab72e81.zip"
        id                             = "pgxflow-backend-dbsnp"
      ~ last_modified                  = "2025-07-15T04:03:39.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:8",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer:4",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CHR_HEADER"               = "chr"
              - "DBSNP_REFERENCE"          = "dbsnp.vcf.gz"
              - "DPORTAL_BUCKET"           = "gaspi-dataportal20250519062439005900000006"
              - "DYNAMO_CLINIC_JOBS_TABLE" = "sbeacon-dataportal-clinic-jobs"
              - "END_HEADER"               = "end"
              - "HTS_S3_HOST"              = "s3.ap-southeast-3.amazonaws.com"
              - "LOOKUP_REFERENCE"         = "RSIGNG_association_matrix.csv"
              - "PGXFLOW_BUCKET"           = "pgxflow-backend-20250519061931564000000002"
              - "PGXFLOW_LOOKUP_LAMBDA"    = "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-lookup"
              - "REFERENCE_BUCKET"         = "pgxflow-backend-references-20250519061930040800000001"
              - "SEND_JOB_EMAIL_ARN"       = "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-lookup-sendJobEmail"
              - "START_HEADER"             = "start"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_lookup/lambda/dbsnp",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/d476bacece0bb69e956795a986f25ad16f982331047d901fd836b8f6aab72e81.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/d476bacece0bb69e956795a986f25ad16f982331047d901fd836b8f6aab72e81.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6797718139769980656" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/b740d1033c5157e1fc4335407fdc9cf6e919fc6834ed7a9ce7d453ed2f503233.zip" -> "builds/d476bacece0bb69e956795a986f25ad16f982331047d901fd836b8f6aab72e81.zip"
          ~ "timestamp" = "1752551957393118000" -> "1754276085577284000"
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-getResultsURL.aws_cloudwatch_log_group.lambda[0] will be destroyed
  # (because aws_cloudwatch_log_group.lambda is not in configuration)
  - resource "aws_cloudwatch_log_group" "lambda" {
      - arn               = "arn:aws:logs:ap-southeast-3:496940679572:log-group:/aws/lambda/pgxflow-backend-lookup-getResultsURL" -> null
      - id                = "/aws/lambda/pgxflow-backend-lookup-getResultsURL" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/lambda/pgxflow-backend-lookup-getResultsURL" -> null
      - region            = "ap-southeast-3" -> null
      - retention_in_days = 0 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "Environment" = "dev"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
      - tags_all          = {
          - "Environment" = "dev"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-getResultsURL.aws_iam_role.lambda[0] will be destroyed
  # (because aws_iam_role.lambda is not in configuration)
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::496940679572:role/pgxflow-backend-lookup-getResultsURL" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-05-19T06:20:00Z" -> null
      - force_detach_policies = true -> null
      - id                    = "pgxflow-backend-lookup-getResultsURL" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "pgxflow-backend-lookup-getResultsURL" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Environment" = "dev"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
      - tags_all              = {
          - "Environment" = "dev"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
      - unique_id             = "AROAXHM7ZAGKHUGGQ73KP" -> null
        # (3 unchanged attributes hidden)

      - inline_policy {
          - name   = "pgxflow-backend-lookup-getResultsURL-0" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = "s3:GetObject"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:s3:::gaspi-dataportal20250519062439005900000006/projects/*/clinical-workflows/*"
                        },
                      - {
                          - Action   = "s3:ListBucket"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:s3:::gaspi-dataportal20250519062439005900000006"
                        },
                      - {
                          - Action   = "dynamodb:GetItem"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-project-users"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "pgxflow-backend-lookup-getResultsURL-logs" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:PutLogEvents",
                              - "logs:CreateLogStream",
                              - "logs:CreateLogGroup",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:logs:ap-southeast-3:496940679572:log-group:/aws/lambda/pgxflow-backend-lookup-getResultsURL:*:*",
                              - "arn:aws:logs:ap-southeast-3:496940679572:log-group:/aws/lambda/pgxflow-backend-lookup-getResultsURL:*",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-getResultsURL.aws_iam_role_policy.additional_jsons[0] will be destroyed
  # (because aws_iam_role_policy.additional_jsons is not in configuration)
  - resource "aws_iam_role_policy" "additional_jsons" {
      - id          = "pgxflow-backend-lookup-getResultsURL:pgxflow-backend-lookup-getResultsURL-0" -> null
      - name        = "pgxflow-backend-lookup-getResultsURL-0" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal20250519062439005900000006/projects/*/clinical-workflows/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal20250519062439005900000006"
                    },
                  - {
                      - Action   = "dynamodb:GetItem"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-project-users"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "pgxflow-backend-lookup-getResultsURL" -> null
        # (1 unchanged attribute hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-getResultsURL.aws_iam_role_policy.logs[0] will be destroyed
  # (because aws_iam_role_policy.logs is not in configuration)
  - resource "aws_iam_role_policy" "logs" {
      - id          = "pgxflow-backend-lookup-getResultsURL:pgxflow-backend-lookup-getResultsURL-logs" -> null
      - name        = "pgxflow-backend-lookup-getResultsURL-logs" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ap-southeast-3:496940679572:log-group:/aws/lambda/pgxflow-backend-lookup-getResultsURL:*:*",
                          - "arn:aws:logs:ap-southeast-3:496940679572:log-group:/aws/lambda/pgxflow-backend-lookup-getResultsURL:*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "pgxflow-backend-lookup-getResultsURL" -> null
        # (1 unchanged attribute hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-getResultsURL.aws_lambda_function.this[0] will be destroyed
  # (because aws_lambda_function.this is not in configuration)
  - resource "aws_lambda_function" "this" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-lookup-getResultsURL" -> null
      - code_sha256                    = "VmINVZA3GTnqj1E1Gt3uMpviB4wal+UxI1yKmfmxF6s=" -> null
      - description                    = "Returns presigned results URL for PGxFlow lookup results" -> null
      - filename                       = "builds/636b8f96e7129fe680c90d9ff4d5d2c46663d9bfac629788001912e4a23f410a.zip" -> null
      - function_name                  = "pgxflow-backend-lookup-getResultsURL" -> null
      - handler                        = "lambda_function.lambda_handler" -> null
      - id                             = "pgxflow-backend-lookup-getResultsURL" -> null
      - invoke_arn                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-lookup-getResultsURL/invocations" -> null
      - last_modified                  = "2025-07-15T04:02:39.000+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:8",
        ] -> null
      - memory_size                    = 1792 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-lookup-getResultsURL:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-lookup-getResultsURL:$LATEST/invocations" -> null
      - region                         = "ap-southeast-3" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::496940679572:role/pgxflow-backend-lookup-getResultsURL" -> null
      - runtime                        = "python3.12" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "VmINVZA3GTnqj1E1Gt3uMpviB4wal+UxI1yKmfmxF6s=" -> null
      - source_code_size               = 761 -> null
      - tags                           = {
          - "Environment"           = "dev"
          - "NAME"                  = "pgxflow-backend"
          - "Owner"                 = "gaspi"
          - "terraform-aws-modules" = "lambda"
        } -> null
      - tags_all                       = {
          - "Environment"           = "dev"
          - "NAME"                  = "pgxflow-backend"
          - "Owner"                 = "gaspi"
          - "terraform-aws-modules" = "lambda"
        } -> null
      - timeout                        = 28 -> null
      - version                        = "$LATEST" -> null
        # (4 unchanged attributes hidden)

      - environment {
          - variables = {
              - "DPORTAL_BUCKET"             = "gaspi-dataportal20250519062439005900000006"
              - "DYNAMO_PROJECT_USERS_TABLE" = "sbeacon-dataportal-project-users"
              - "RESULT_SUFFIX"              = "_lookup_results.jsonl"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/pgxflow-backend-lookup-getResultsURL" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-getResultsURL.null_resource.archive[0] will be destroyed
  # (because null_resource.archive is not in configuration)
  - resource "null_resource" "archive" {
      - id       = "5240124371498391662" -> null
      - triggers = {
          - "filename"  = "builds/636b8f96e7129fe680c90d9ff4d5d2c46663d9bfac629788001912e4a23f410a.zip"
          - "timestamp" = "1748827737850705000"
        } -> null
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/pgxflow-backend-gnomad"
        name              = "/aws/lambda/pgxflow-backend-gnomad"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "pgxflow-backend-gnomad"
        name                  = "pgxflow-backend-gnomad"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "pgxflow-backend-gnomad:pgxflow-backend-gnomad-0"
        name        = "pgxflow-backend-gnomad-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::pgxflow-backend-20250519061931564000000002/*"
                    },
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal20250519062439005900000006/projects/*/clinical-workflows/*"
                    },
                  - {
                      - Action   = "s3:DeleteObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::pgxflow-backend-20250519061931564000000002/*"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-lookup-sendJobEmail"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-gnomad"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:8",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer:4",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "DPORTAL_BUCKET"           = "gaspi-dataportal20250519062439005900000006"
              - "DYNAMO_CLINIC_JOBS_TABLE" = "sbeacon-dataportal-clinic-jobs"
              - "PGXFLOW_BUCKET"           = "pgxflow-backend-20250519061931564000000002"
              - "RESULT_SUFFIX"            = "_lookup_results.jsonl"
              - "SEND_JOB_EMAIL_ARN"       = "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-lookup-sendJobEmail"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8442869331046785128" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748827738178430000" -> "1754276085658144000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-initLookup.aws_cloudwatch_log_group.lambda[0] will be destroyed
  # (because aws_cloudwatch_log_group.lambda is not in configuration)
  - resource "aws_cloudwatch_log_group" "lambda" {
      - arn               = "arn:aws:logs:ap-southeast-3:496940679572:log-group:/aws/lambda/pgxflow-backend-initLookup" -> null
      - id                = "/aws/lambda/pgxflow-backend-initLookup" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/lambda/pgxflow-backend-initLookup" -> null
      - region            = "ap-southeast-3" -> null
      - retention_in_days = 0 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "Environment" = "dev"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
      - tags_all          = {
          - "Environment" = "dev"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-initLookup.aws_iam_role.lambda[0] will be destroyed
  # (because aws_iam_role.lambda is not in configuration)
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::496940679572:role/pgxflow-backend-initLookup" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-05-19T06:20:01Z" -> null
      - force_detach_policies = true -> null
      - id                    = "pgxflow-backend-initLookup" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "pgxflow-backend-initLookup" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Environment" = "dev"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
      - tags_all              = {
          - "Environment" = "dev"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
      - unique_id             = "AROAXHM7ZAGKJGMEPLKZ5" -> null
        # (3 unchanged attributes hidden)

      - inline_policy {
          - name   = "pgxflow-backend-initLookup-0" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action    = "s3:ListBucket"
                          - Condition = {
                              - StringLike = {
                                  - "s3:prefix" = "projects/*/project-files/*"
                                }
                            }
                          - Effect    = "Allow"
                          - Resource  = "arn:aws:s3:::gaspi-dataportal20250519062439005900000006"
                        },
                      - {
                          - Action   = "s3:GetObject"
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:s3:::pgxflow-backend-references-20250519061930040800000001/*",
                              - "arn:aws:s3:::gaspi-dataportal20250519062439005900000006/projects/*/project-files/*",
                            ]
                        },
                      - {
                          - Action   = "dynamodb:GetItem"
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-project-users",
                              - "arn:aws:dynamodb:ap-southeast-3:496940679572:table/pgxflow-references",
                            ]
                        },
                      - {
                          - Action   = [
                              - "dynamodb:UpdateItem",
                              - "dynamodb:PutItem",
                              - "dynamodb:GetItem",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinic-jobs"
                        },
                      - {
                          - Action   = "lambda:InvokeFunction"
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-lookup-sendJobEmail",
                              - "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-dbsnp",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "pgxflow-backend-initLookup-logs" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:PutLogEvents",
                              - "logs:CreateLogStream",
                              - "logs:CreateLogGroup",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:logs:ap-southeast-3:496940679572:log-group:/aws/lambda/pgxflow-backend-initLookup:*:*",
                              - "arn:aws:logs:ap-southeast-3:496940679572:log-group:/aws/lambda/pgxflow-backend-initLookup:*",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-initLookup.aws_iam_role_policy.additional_jsons[0] will be destroyed
  # (because aws_iam_role_policy.additional_jsons is not in configuration)
  - resource "aws_iam_role_policy" "additional_jsons" {
      - id          = "pgxflow-backend-initLookup:pgxflow-backend-initLookup-0" -> null
      - name        = "pgxflow-backend-initLookup-0" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:ListBucket"
                      - Condition = {
                          - StringLike = {
                              - "s3:prefix" = "projects/*/project-files/*"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "arn:aws:s3:::gaspi-dataportal20250519062439005900000006"
                    },
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::pgxflow-backend-references-20250519061930040800000001/*",
                          - "arn:aws:s3:::gaspi-dataportal20250519062439005900000006/projects/*/project-files/*",
                        ]
                    },
                  - {
                      - Action   = "dynamodb:GetItem"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-project-users",
                          - "arn:aws:dynamodb:ap-southeast-3:496940679572:table/pgxflow-references",
                        ]
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-lookup-sendJobEmail",
                          - "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-dbsnp",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "pgxflow-backend-initLookup" -> null
        # (1 unchanged attribute hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-initLookup.aws_iam_role_policy.logs[0] will be destroyed
  # (because aws_iam_role_policy.logs is not in configuration)
  - resource "aws_iam_role_policy" "logs" {
      - id          = "pgxflow-backend-initLookup:pgxflow-backend-initLookup-logs" -> null
      - name        = "pgxflow-backend-initLookup-logs" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ap-southeast-3:496940679572:log-group:/aws/lambda/pgxflow-backend-initLookup:*:*",
                          - "arn:aws:logs:ap-southeast-3:496940679572:log-group:/aws/lambda/pgxflow-backend-initLookup:*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "pgxflow-backend-initLookup" -> null
        # (1 unchanged attribute hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-initLookup.aws_lambda_function.this[0] will be destroyed
  # (because aws_lambda_function.this is not in configuration)
  - resource "aws_lambda_function" "this" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-initLookup" -> null
      - code_sha256                    = "0LGEuJAC/x0eGUpEcUcZnfBzvxUBVPRG01TrIhMs+J4=" -> null
      - description                    = "Inititializes a PGxFlow lookup table job" -> null
      - filename                       = "builds/3b962a321bdf8e5e4a8e21b4841581e0dd2ab640971e2acac27ab3999fdb95e8.zip" -> null
      - function_name                  = "pgxflow-backend-initLookup" -> null
      - handler                        = "lambda_function.lambda_handler" -> null
      - id                             = "pgxflow-backend-initLookup" -> null
      - invoke_arn                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-initLookup/invocations" -> null
      - last_modified                  = "2025-07-15T04:03:53.000+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:8",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer:4",
        ] -> null
      - memory_size                    = 1792 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-initLookup:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-initLookup:$LATEST/invocations" -> null
      - region                         = "ap-southeast-3" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::496940679572:role/pgxflow-backend-initLookup" -> null
      - runtime                        = "python3.12" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "0LGEuJAC/x0eGUpEcUcZnfBzvxUBVPRG01TrIhMs+J4=" -> null
      - source_code_size               = 1710 -> null
      - tags                           = {
          - "Environment"           = "dev"
          - "NAME"                  = "pgxflow-backend"
          - "Owner"                 = "gaspi"
          - "terraform-aws-modules" = "lambda"
        } -> null
      - tags_all                       = {
          - "Environment"           = "dev"
          - "NAME"                  = "pgxflow-backend"
          - "Owner"                 = "gaspi"
          - "terraform-aws-modules" = "lambda"
        } -> null
      - timeout                        = 28 -> null
      - version                        = "$LATEST" -> null
        # (4 unchanged attributes hidden)

      - environment {
          - variables = {
              - "CHR_HEADER"                      = "chr"
              - "DYNAMO_CLINIC_JOBS_TABLE"        = "sbeacon-dataportal-clinic-jobs"
              - "DYNAMO_PGXFLOW_REFERENCES_TABLE" = "pgxflow-references"
              - "DYNAMO_PROJECT_USERS_TABLE"      = "sbeacon-dataportal-project-users"
              - "END_HEADER"                      = "end"
              - "HTS_S3_HOST"                     = "s3.ap-southeast-3.amazonaws.com"
              - "LOOKUP_REFERENCE"                = "RSIGNG_association_matrix.csv"
              - "PGXFLOW_DBSNP_LAMBDA"            = "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-dbsnp"
              - "REFERENCE_BUCKET"                = "pgxflow-backend-references-20250519061930040800000001"
              - "SEND_JOB_EMAIL_ARN"              = "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-lookup-sendJobEmail"
              - "START_HEADER"                    = "start"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/pgxflow-backend-initLookup" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-initLookup.null_resource.archive[0] will be destroyed
  # (because null_resource.archive is not in configuration)
  - resource "null_resource" "archive" {
      - id       = "2127140919552461603" -> null
      - triggers = {
          - "filename"  = "builds/3b962a321bdf8e5e4a8e21b4841581e0dd2ab640971e2acac27ab3999fdb95e8.zip"
          - "timestamp" = "1752551957493989000"
        } -> null
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/pgxflow-backend-lookup"
        name              = "/aws/lambda/pgxflow-backend-lookup"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "pgxflow-backend-lookup"
        name                  = "pgxflow-backend-lookup"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "pgxflow-backend-lookup:pgxflow-backend-lookup-0"
        name        = "pgxflow-backend-lookup-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::pgxflow-backend-references-20250519061930040800000001",
                          - "arn:aws:s3:::pgxflow-backend-20250519061931564000000002",
                        ]
                    },
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::pgxflow-backend-references-20250519061930040800000001/*",
                          - "arn:aws:s3:::pgxflow-backend-20250519061931564000000002/*",
                        ]
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::pgxflow-backend-20250519061931564000000002/*"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-lookup-sendJobEmail",
                          - "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-gnomad",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/d86b632af5f25dbb7d2c3789899df165183af56648b7486c70ccc9daffc37e6a.zip" -> "builds/f7e966b362d2be772bc00d96e72e8d91e5b9712881cd94ca038dafd5bc60b2ff.zip"
        id                             = "pgxflow-backend-lookup"
      ~ last_modified                  = "2025-07-15T04:03:27.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:8",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer:4",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CHR_HEADER"               = "chr"
              - "DPORTAL_BUCKET"           = "gaspi-dataportal20250519062439005900000006"
              - "DYNAMO_CLINIC_JOBS_TABLE" = "sbeacon-dataportal-clinic-jobs"
              - "END_HEADER"               = "end"
              - "HTS_S3_HOST"              = "s3.ap-southeast-3.amazonaws.com"
              - "LOOKUP_REFERENCE"         = "RSIGNG_association_matrix.csv"
              - "PGXFLOW_BUCKET"           = "pgxflow-backend-20250519061931564000000002"
              - "PGXFLOW_GNOMAD_LAMBDA"    = "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-gnomad"
              - "REFERENCE_BUCKET"         = "pgxflow-backend-references-20250519061930040800000001"
              - "RESULT_SUFFIX"            = "_lookup_results.jsonl"
              - "SEND_JOB_EMAIL_ARN"       = "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-lookup-sendJobEmail"
              - "START_HEADER"             = "start"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_lookup/lambda/lookup",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/f7e966b362d2be772bc00d96e72e8d91e5b9712881cd94ca038dafd5bc60b2ff.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/f7e966b362d2be772bc00d96e72e8d91e5b9712881cd94ca038dafd5bc60b2ff.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8834777711838467924" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/d86b632af5f25dbb7d2c3789899df165183af56648b7486c70ccc9daffc37e6a.zip" -> "builds/f7e966b362d2be772bc00d96e72e8d91e5b9712881cd94ca038dafd5bc60b2ff.zip"
          ~ "timestamp" = "1751933429040074200" -> "1754276085762104000"
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-sendJobEmail.aws_cloudwatch_log_group.lambda[0] will be destroyed
  # (because aws_cloudwatch_log_group.lambda is not in configuration)
  - resource "aws_cloudwatch_log_group" "lambda" {
      - arn               = "arn:aws:logs:ap-southeast-3:496940679572:log-group:/aws/lambda/pgxflow-backend-lookup-sendJobEmail" -> null
      - id                = "/aws/lambda/pgxflow-backend-lookup-sendJobEmail" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/lambda/pgxflow-backend-lookup-sendJobEmail" -> null
      - region            = "ap-southeast-3" -> null
      - retention_in_days = 0 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "Environment" = "dev"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
      - tags_all          = {
          - "Environment" = "dev"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-sendJobEmail.aws_iam_role.lambda[0] will be destroyed
  # (because aws_iam_role.lambda is not in configuration)
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::496940679572:role/pgxflow-backend-lookup-sendJobEmail" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-06-06T06:13:23Z" -> null
      - force_detach_policies = true -> null
      - id                    = "pgxflow-backend-lookup-sendJobEmail" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "pgxflow-backend-lookup-sendJobEmail" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Environment" = "dev"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
      - tags_all              = {
          - "Environment" = "dev"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
      - unique_id             = "AROAXHM7ZAGKI4NLR6JMX" -> null
        # (3 unchanged attributes hidden)

      - inline_policy {
          - name   = "pgxflow-backend-lookup-sendJobEmail-0" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = "lambda:InvokeFunction"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:lambda:ap-southeast-3:496940679572:function:cognito-sendClinicJobEmail"
                        },
                      - {
                          - Action   = [
                              - "dynamodb:UpdateItem",
                              - "dynamodb:PutItem",
                              - "dynamodb:GetItem",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinic-jobs"
                        },
                      - {
                          - Action   = "cognito-idp:ListUsers"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:cognito-idp:ap-southeast-3:496940679572:userpool/ap-southeast-3_Ta5TVYZ4S"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "pgxflow-backend-lookup-sendJobEmail-logs" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:PutLogEvents",
                              - "logs:CreateLogStream",
                              - "logs:CreateLogGroup",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:logs:ap-southeast-3:496940679572:log-group:/aws/lambda/pgxflow-backend-lookup-sendJobEmail:*:*",
                              - "arn:aws:logs:ap-southeast-3:496940679572:log-group:/aws/lambda/pgxflow-backend-lookup-sendJobEmail:*",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-sendJobEmail.aws_iam_role_policy.additional_jsons[0] will be destroyed
  # (because aws_iam_role_policy.additional_jsons is not in configuration)
  - resource "aws_iam_role_policy" "additional_jsons" {
      - id          = "pgxflow-backend-lookup-sendJobEmail:pgxflow-backend-lookup-sendJobEmail-0" -> null
      - name        = "pgxflow-backend-lookup-sendJobEmail-0" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:496940679572:function:cognito-sendClinicJobEmail"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:496940679572:userpool/ap-southeast-3_Ta5TVYZ4S"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "pgxflow-backend-lookup-sendJobEmail" -> null
        # (1 unchanged attribute hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-sendJobEmail.aws_iam_role_policy.logs[0] will be destroyed
  # (because aws_iam_role_policy.logs is not in configuration)
  - resource "aws_iam_role_policy" "logs" {
      - id          = "pgxflow-backend-lookup-sendJobEmail:pgxflow-backend-lookup-sendJobEmail-logs" -> null
      - name        = "pgxflow-backend-lookup-sendJobEmail-logs" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ap-southeast-3:496940679572:log-group:/aws/lambda/pgxflow-backend-lookup-sendJobEmail:*:*",
                          - "arn:aws:logs:ap-southeast-3:496940679572:log-group:/aws/lambda/pgxflow-backend-lookup-sendJobEmail:*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "pgxflow-backend-lookup-sendJobEmail" -> null
        # (1 unchanged attribute hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-sendJobEmail.aws_lambda_function.this[0] will be destroyed
  # (because aws_lambda_function.this is not in configuration)
  - resource "aws_lambda_function" "this" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-lookup-sendJobEmail" -> null
      - code_sha256                    = "Deq1KGESDlMEmL+Zs1MjfsCIP9Pc/B/22+uKqIo2JBc=" -> null
      - description                    = "Invokes sendJobEmail to send email to user" -> null
      - filename                       = "builds/725b2562166dbf31a256a1aa152f5e4119a08f195a8effd01dd97246da888268.zip" -> null
      - function_name                  = "pgxflow-backend-lookup-sendJobEmail" -> null
      - handler                        = "lambda_function.lambda_handler" -> null
      - id                             = "pgxflow-backend-lookup-sendJobEmail" -> null
      - invoke_arn                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-lookup-sendJobEmail/invocations" -> null
      - last_modified                  = "2025-07-15T04:02:51.000+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:8",
        ] -> null
      - memory_size                    = 1792 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-lookup-sendJobEmail:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:pgxflow-backend-lookup-sendJobEmail:$LATEST/invocations" -> null
      - region                         = "ap-southeast-3" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::496940679572:role/pgxflow-backend-lookup-sendJobEmail" -> null
      - runtime                        = "python3.12" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "Deq1KGESDlMEmL+Zs1MjfsCIP9Pc/B/22+uKqIo2JBc=" -> null
      - source_code_size               = 1070 -> null
      - tags                           = {
          - "Environment"           = "dev"
          - "NAME"                  = "pgxflow-backend"
          - "Owner"                 = "gaspi"
          - "terraform-aws-modules" = "lambda"
        } -> null
      - tags_all                       = {
          - "Environment"           = "dev"
          - "NAME"                  = "pgxflow-backend"
          - "Owner"                 = "gaspi"
          - "terraform-aws-modules" = "lambda"
        } -> null
      - timeout                        = 28 -> null
      - version                        = "$LATEST" -> null
        # (4 unchanged attributes hidden)

      - environment {
          - variables = {
              - "COGNITO_CLINIC_JOB_EMAIL_LAMBDA" = "arn:aws:lambda:ap-southeast-3:496940679572:function:cognito-sendClinicJobEmail"
              - "DYNAMO_CLINIC_JOBS_TABLE"        = "sbeacon-dataportal-clinic-jobs"
              - "USER_POOL_ID"                    = "ap-southeast-3_Ta5TVYZ4S"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/pgxflow-backend-lookup-sendJobEmail" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-sendJobEmail.null_resource.archive[0] will be destroyed
  # (because null_resource.archive is not in configuration)
  - resource "null_resource" "archive" {
      - id       = "5729629437967361841" -> null
      - triggers = {
          - "filename"  = "builds/725b2562166dbf31a256a1aa152f5e4119a08f195a8effd01dd97246da888268.zip"
          - "timestamp" = "1751933428640266800"
        } -> null
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/pgxflow-backend-lookup-updateReferenceFiles"
        name              = "/aws/lambda/pgxflow-backend-lookup-updateReferenceFiles"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "pgxflow-backend-lookup-updateReferenceFiles"
        name                  = "pgxflow-backend-lookup-updateReferenceFiles"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-lookup-updateReferenceFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:8",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7966616518968195866" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1752551957267170000" -> "1754276085845216000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_pharmcat_lambda.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers"
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "808def54ec82963c08b28a78bc6518a4595c627b"
        }

      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "pgxflow/pipeline_pharmcat/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "pgxflow/pipeline_pharmcat/lambda/pharmcat"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_pharmcat_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:9d9e8430ae2abca42666eaf78935dad7c851283dd6520da5fa5fd8da0b05401f" -> (known after apply)
        name                 = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers"
      ~ sha256_digest        = "sha256:9d9e8430ae2abca42666eaf78935dad7c851283dd6520da5fa5fd8da0b05401f" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "aced62809a9947982c71e20d1e3c5f1ac46d46de" -> "808def54ec82963c08b28a78bc6518a4595c627b"
        }
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_preprocessor_lambda.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers"
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "2693d2cbed1bd131689f7795ccb759cb22f99992"
        }

      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "pgxflow/pipeline_pharmcat/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "pgxflow/pipeline_pharmcat/lambda/preprocessor"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_preprocessor_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:104c27740efff38dabefba4e4eb5a796e7f470820385e595c1669c9b625c211e" -> (known after apply)
        name                 = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers"
      ~ sha256_digest        = "sha256:104c27740efff38dabefba4e4eb5a796e7f470820385e595c1669c9b625c211e" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "02a0a9ed3223c21f4e3ea60da7da0a5a0e0ce54d" -> "2693d2cbed1bd131689f7795ccb759cb22f99992"
        }
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-getResultsURL.aws_cloudwatch_log_group.lambda[0] will be destroyed
  # (because aws_cloudwatch_log_group.lambda is not in configuration)
  - resource "aws_cloudwatch_log_group" "lambda" {
      - arn               = "arn:aws:logs:ap-southeast-3:496940679572:log-group:/aws/lambda/pgxflow-backend-pharmcat-getResultsURL" -> null
      - id                = "/aws/lambda/pgxflow-backend-pharmcat-getResultsURL" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/lambda/pgxflow-backend-pharmcat-getResultsURL" -> null
      - region            = "ap-southeast-3" -> null
      - retention_in_days = 0 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "Environment" = "dev"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
      - tags_all          = {
          - "Environment" = "dev"
          - "NAME"        = "pgxflow-backend"
          - "Owner"       = "gaspi"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-getResultsURL.aws_iam_role.lambda[0] will be destroyed
  # (because aws_iam_role.lambda is not in configuration)
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::496940679572:role/pgxflow-backend-pharmcat-getResultsURL" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement =
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.